Repository: berdemozdemir/nextjs-lingui-i18n-example
Catalog: locales/*.po
Languages: de, tr

source: {count, plural, =0 {No items} =1 {# item} other {# items}}
de: {count, plural, =0 {Keine Elemente} =1 {# Element} other {# Elemente}}
tr: {count, plural, =0 {Öğe yok} =1 {# öğe} other {# öğe}}

source: {gender, select, male {He replied} female {She replied} other {They replied}}
de: {gender, select, male {Er antwortete} female {Sie antwortete} other {Sie antworteten}}
tr: {gender, select, male {Yanıtladı (e)} female {Yanıtladı (k)} other {Yanıtladı}}

source: {rank, selectordinal, =0 {No rank} one {#st} two {#nd} few {#rd} other {#th}}
de: {rank, selectordinal, =0 {Kein Rang} other {#.}}
tr: {rank, selectordinal, =0 {Sıra yok} other {#. sırada}}

source: Across different cultures, things like count of objects, numbers (i.e. money), gender, and dates can cause a sentence structure to change in a unique way to that language.
de: In verschiedenen Kulturen können Faktoren wie Objektanzahl, Zahlen (z. B. Geld), Genus und Datumsangaben die Satzstruktur sprachspezifisch verändern.
tr: Farklı kültürlerde nesne sayısı, sayılar (örn. para), cinsiyet ve tarihler gibi unsurlar cümle yapısının dile özgü biçimde değişmesine neden olabilir.

source: Action Example
de: Beispiel für eine Serveraktion

source: Additionally, you may have a dynamic value used in your localization, which would need to be handled differently based on different languages' grammar, etc.
de: Zusätzlich kann es in der Lokalisierung einen dynamischen Wert geben, der je nach Grammatik usw. verschiedener Sprachen unterschiedlich behandelt werden muss.
tr: Ayrıca yerelleştirmede kullanılan dinamik bir değer, dillerin dil bilgisi kurallarına göre farklı ele alınmalıdır.

source: API Example
de: API Beispiel

source: Client Example
de: Client-Beispiel
tr: Client Örneği

source: Client rendered
de: Clientseitig gerendert
tr: Client Derlendi

source: Client side translated title
de: Clientseitig übersetzter Titel
tr: Client tarafı çevirilmiş başlık

source: female
de: weiblich
tr: kadın

source: Home Page
de: Startseite
tr: Ana Sayfa

source: ICU Example
de: IAU-Beispiele

source: Lingui + Next.js RSC example
de: Lingui + Next.js RSC Beispiel
tr: Lingui + Nextjs RSC Örnekleri

# heading
source: server.description
de: Lingui + Next.js RSC Beispiel
tr: Lingui + Nextjs Örnekleri

source: Load Message
de: Nachricht laden

source: male
de: männlich
tr: erkek

source: other
de: anderer
tr: diğer

source: Server Example
de: Server-Beispiel
tr: Server Örneği

source: Server rendered
de: Server-gerendert
tr: Server tarafı derlendi

source: Server side translated title
de: Serverseitig übersetzter Titel
tr: Server tarafı çevirilmiş başlık

source: The ICU <0>(International Components for Unicode)</0> format is a way of handling different linguistic and cultural needs for a given localization.
de: Das ICU <0>(International Components for Unicode)</0> Format ist eine Methode, um unterschiedliche sprachliche und kulturelle Anforderungen bei einer bestimmten Lokalisierung zu handhaben.
tr: ICU <0>(Unicode için Uluslararası Bileşenler)</0> biçimi, belirli bir yerelleştirme için farklı dilsel ve kültürel gereksinimleri ele almanın bir yoludur.

source: The ICU Format
de: Das ICU Format
tr: ICU format

source: api.hello
de: Die Nachrichten von der API wurden erfolgreich geladen.

source: action.hello
de: Serveraktionsmeldungen wurden erfolgreich geladen.

source: Translations can be used with dynamic values, as shown in the examples below:
de: Übersetzungen können mit dynamischen Werten verwendet werden, wie in den folgenden Beispielen gezeigt:
tr: Çeviriler, aşağıdaki örneklerde gösterildiği gibi dinamik değerlerle kullanılabilir:

source: You've ranked as {rank}
de: Sie haben den Rang {rank} erreicht
tr: {rank} yer aldınız

source: You've selected the value {count}
de: Sie haben den Wert {count} ausgewählt
tr: {count} değerini seçtiniz

source: Count Examples
tr: Sayı Örneği

source: ICU Examples
tr: ICU Örneği

source: You've selected the gender {gender}
tr: {gender} cinsiyeti seçtiniz
